Revit 2027 API
CurveLoop.GetExactLength Method
 Returns the sum of exact lengths of all curves in the loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetExactLength()
Public Function GetExactLength As Double
public:
double GetExactLength()
member GetExactLength : unit -> float
Return Value
Double
 The total length of the curves in the loop.
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace